app/controllers/posts_controller.rb

	def create
		@post = Post.new(params[:post])

		if @post.save
---
INSERT INTO "posts" ("content", "created_at", "email", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "ddd"], ["created_at", Thu, 14 Nov 2013 11:22:50 UTC +00:00], ["email", "sarathsprakash@gmail.com"], ["title", "dd"], ["updated_at", Thu, 14 Nov 2013 11:22:50 UTC +00:00]]